/*
Задача - залить код на github
    Создай новый публичный github репозиторий, в названии которого есть текст hw-4.
    Добавь в корень репозитория файл uid.txt с твоим личным идентификатором (узнать его можно, написав боту слово uid).
    Также добавь в корень репозитория файл ControlPanelTest.java, в котором будет исходный код решения предыдущей задачи.
    Отправь ссылку на репозиторий в редактор java-кода и нажми на кнопку "Проверить".
        https://github.com/SergeyHodak/Module4DZJavaTasks-hw-4
 */